[{
    "id": "cauliflower-salad",
    "title": "Cauliflower Salad",
    "ingredients": "1 head cauliflower, broken into florets\n1 sweet potato, chopped\n1½ cups chickpeas\n1 tbsp extra virgin olive oil\n2 tsp paprika\n1 tsp cumin\n½ tsp garlic powder\n1½ tsp salt\n1 cup quinoa, cooked\n3 cups spinach\n1 avocado, peeled, pitted and chopped\n1 cup cucumber, sliced\n½ cup pickled red onions\n3 tbsp fresh dill\n1 cup extra firm tofu\n1 handful parsley\n1 handful fresh dill\n1 tbsp nutritional yeast\n1 tsp salt\n1 lemon, juiced\n1 clove garlic\n¼ cup water, or more as needed",
    "instructions": "Preheat the oven to 400F and line a baking sheet with parchment. If you don't already have quinoa prepared, cook it according to package directions at this time. 1/3 a cup of dry quinoa will typically lend 1 cup cooked.\nPlace the chickpeas, onion, cauliflower and sweet potato on the sheet pan, and drizzle with oil, and then the spices. You can do this in a bowl for easier preparation, if desired. Roast for 35 minutes, until the sweet potato and cauliflower are slightly soft.\nWhile the vegetables roast, prepare your high protein dressing. In a blender, combine the tofu, parsley, dill, nutritional yeast, salt, lemon, garlic and water. Combine until smooth, adding more water as needed to reach a desired consistency.\nWhen the vegetables are roasted, place a bed of spinach in a bowl, and disperse the toppings as desired, with fresh avocado and cucumber on top. If desired, add pickled onions and dill. Drizzle on the high protein dressing and enjoy.",
    "source": "https://plantyou.com/cauliflower-salad/",
    "tags": ["salad", "vegetarian"]
},
{
    "id": "spiced-lentils-with-carrots",
    "title": "Spiced Lentils with Carrots",
    "ingredients": "1 yellow onion\n4 cloves garlic\n1 tsp fresh grated ginger\n4 carrots (about 2 cups chopped)\n2 Tbsp olive oil\n1 tsp ground cumin\n1/2 tsp cinnamon\n1/2 tsp allspice\n1/4 tsp crushed red pepper\n1 cup brown lentils\n3 Tbsp tomato paste\n1/4 cup chopped dried apricots\n3 cups vegetable broth\n1 Tbsp chopped parsley",
    "instructions": "Dice the onion, mince the garlic, grate the ginger, and peel and dice the carrots.\nAdd the onion, garlic, ginger, and olive oil to a deep skillet. Sauté over medium heat until the onions are soft and translucent (about five minutes).\nAdd the diced carrots, cumin, cinnamon, allspice, and crushed red pepper to the skillet. Continue to sauté for about two minutes more.\nNext, add the uncooked lentils, tomato paste, raisins or chopped apricots, and broth to the skillet. Stir until the tomato paste has dissolved into the broth. Place a lid on the skillet and turn the heat up to high.\nAllow the broth to come to a full boil. Once boiling, turn the heat down to medium-low and let the lentils simmer in the broth with the lid on for 30 minutes, stirring only occasionally.\nAfter 30 minutes the lentils and carrots should be very tender. Give the lentils a taste and add salt or pepper if needed (this will depend on the salt content of your broth, I did not add any).\nServe the spiced lentils with crusty bread for dipping, or over a bed of polenta or mashed potatoes. Top with chopped fresh parsley if desired.",
    "source": "https://www.budgetbytes.com/spiced-lentils-with-carrots/",
    "tags": ["vegetarian"]
},
{
    "id": "curry-and-rice-recipe",
    "title": "Curry and Rice Recipe",
    "ingredients": "1/2 lb beef (cut for stew)\n2 onions (medium)\n2 carrots (small)\n3 potatoes (medium)\n1 Tbsp oil\n3 1/2 cups water\n4 oz Japanese curry mix\nsteamed rice\n1 Tbsp ketchup\n1 Tbsp Worcestershire sauce\n1 Tbsp soy sauce",
    "instructions": "Cut meat and vegetables into bite size pieces.\nHeat oil in a pot, add meat and brown in oil. Take the meat out.\nIn the same pot, fry onions for 8 minutes. Add carrots and potatoes, then add the cooked meat.\nAdd water to the pot. After it boils, skim any fat, and reduce heat to low. Cover and cook for 45 minutes until the meat becomes tender. If using a pressure cooker, cook for 15 minutes.\nRemove from heat and add curry sauce mix. Stir well so the pieces of the mix dissolve.\nIf you'd like to use the optional seasonings above, now add the ketchup, Worcestershire sauce, and soy sauce. Let simmer for 10-15 minutes (cook longer if you'd like it thicker).\nPour the curry over rice.",
    "source": "https://www.japanesecooking101.com/curry-and-rice-recipe/",
    "tags": ["beef"]
},
{
    "id": "herby-italian-orzo-salad",
    "title": "Herby Olive Italian Orzo Salad",
    "ingredients": "10 ounces orzo\n1 1/2 cups halved cherry tomatoes\n2 persian cucumbers, sliced and quartered\n1 red bell pepper, diced\n1/2 cup pitted chopped or sliced kalamata olives\n1/2 cup pitted chopped or sliced green olives\n1/3 cup sliced pepperoncini\n1/4 cup thinly sliced red onion\n1/2 cup feta crumbles\n1/3 cup chopped fresh basil\n1/4 cup chopped fresh parsley",
    "instructions": "Cook your pasta until al dente according to the directions on the package. Once done cooking, drain and add to a large bowl.\nAdd the tomatoes, cucumber, bell pepper, kalamata olives, green olives, pepperoncinis, red onion, feta, basil and parsley to the bowl with the pasta. Pour dressing over the top and toss together until combined.\nServe and enjoy!",
    "source": "https://www.ambitiouskitchen.com/herby-italian-orzo-salad/",
    "tags": ["salad", "vegetarian"]
},
{
    "id": "the-best-sugar-cookie-recipe",
    "title": "Sugar Cookies",
    "ingredients": "3 cups all-purpose flour\n1 1/2 teaspoons baking powder\n1 teaspoon fine sea salt\n3 sticks unsalted butter\n1 1/2 cups granulated sugar\n2 large eggs\n1 tablespoon pure vanilla extract",
    "instructions": "Preheat the oven to 375 degrees.\nMix the flour, baking powder, and salt in a medium bowl.\nPlace the softened butter and sugar in the bowl of your electric mixer. Cream the butter and sugar together on high until light and fluffy, 3-5 minutes.\nWith the mixer running on low, slowly add the flour mixture.\nPour some extra sugar into a bowl to coat the cookies. Scoop the dough out and roll into 1-inch balls.\nBake each sheet of sugar cookies for 9-11 minutes, until the edges are slightly golden and the centers are just barely set. Cool completely on the cookie sheets.",
    "source": "https://www.aspicyperspective.com/the-best-sugar-cookie-recipe/",
    "tags": ["dessert"]
},
{
    "id": "crispy-tofu-pad-thai",
    "title": "Crispy Tofu Pad Thai",
    "ingredients": "6 ounces firm or extra-firm tofu\n5 ounces dried rice noodles\n2 tablespoons fish sauce\n2 tablespoons tamarind concentrate\n2 to 4 teaspoons dark brown sugar\nA pinch or two Thai or other chile flakes\n1 small shallot, chopped\n2 garlic cloves\n2 tablespoons sweet preserved radish, grated or minced\n1 cup bean sprouts\n1 large egg\n4 garlic chives",
    "instructions": "Prepare tofu: Drain the tofu, and place it on a few paper towels; place a few more towels over it.\nPrepare noodles: Meanwhile, place noodles in a large bowl; pour hot water over to cover.\nPrepare the sauce: Stir together fish sauce, tamarind, brown sugar, and chili powder.\nCrisp the tofu: Heat a large frying pan or a wok over high for a full minute, then add a tablespoon or two of oil and let this heat for a full minute too, and then add tofu cubes. Reduce heat to medium-high. Cook them until browned underneath, then use a thin spatula to turn them and cook some more, until all sides are golden and crisp.\nCook the pad thai: Add another generous glug oil to the hot pan and, once very hot, cook garlic, shallots, and radishes for a minute, until they take on a little edge of color.Add noodles and sauce and cook until noodles absorb sauce.\nTo finish: Around the rim, leave extra garnishes in a little piles. Squeeze lime juice over before eating.",
    "source": "https://smittenkitchen.com/2018/04/crispy-tofu-pad-thai/",
    "tags": ["thai", "tofu"]
},
{

    "id": "test",
    "title": "Test Recipe",
    "ingredients": "1/2 an ingredient\n1 cup second ingredient",
    "instructions": "Combine first ingredient and second ingredient.\nCook until ready to serve.",
    "source": "test",
    "tags": ["test"]
}]